{
  "pageTitle": "Luca's Portfolio",
  "nav": {
    "home": "Home",
    "projects": "Projects",
    "contact": "Contact"
  },
  "home": {
    "title": "Welcome to my Portfolio",
    "subtitle": "Engineering preparatory student, specializing in computer science",
    "presentationText": "Hello, I'm Luca. I love exploring new technologies and creating innovative solutions. When I'm not designing, I enjoy surfing and playing video games!",
    "carouselTitle": "My Skills",
    "projectsCV": {
      "tagline": "Discover my projects and professional journey",
      "viewProjects": "View my projects",
      "downloadCV": "Download my CV"
    },
    "propositions": {
      "title": "My Services",
      "subtitle": "I offer tailored solutions for your digital needs",
      "webDev": {
        "title": "Web Development",
        "description": "Creation of modern, responsive websites optimized for search engines."
      },
      "appDev": {
        "title": "Applications",
        "description": "Development of custom web and mobile applications according to your needs."
      },
      "plugins": {
        "title": "Plugins & Extensions",
        "description": "Creation of plugins and extensions to enhance the functionality of your platforms."
      },
      "contactMe": "Contact Me"
    }
  },
  "projects": {
    "title": "My Projects",
    "viewProject": "View project",
    "details": "Technical details",
    "technologiesUsed": "Technologies used",
    "description": "Description",
    "descriptionComingSoon": "Detailed project description coming soon...",
    "downloadCode": "Download code",
    "viewOnGithub": "View on GitHub",
    "visitSite": "Visit Site",
    "backToProjects": "Back to Projects",
    "projectNotFound": "Project Not Found",
    "projectDoesNotExist": "The project you are looking for does not exist.",
    "inProgress": "In Development",
    "project1": {
      "title": "Escape no Game Project",
      "description": "This project aims to develop a solution ensuring communication in areas without network coverage, such as those where waves are blocked. Following the infiltration of agent K57, captured in a cyber-pirate base inaccessible by conventional methods, the objective is to prevent such situations from recurring by designing technology adapted to these critical environments. How does it work? The agent speaks into a microphone, where the sound is converted into a signal that varies according to what they say and how they say it. This signal is characterized by its intensity, frequency, and amplitude. The signal is then transmitted by a transmitter on an inaudible frequency, allowing messages to be sent without risk of detection. The listening agent intercepts this signal, decodes it, and transcribes the voice and message of the transmitter. To analyze the sound signal, it is first converted into an electrical signal, whose voltage evolves in synchronization with the sound signal and shares the same period. This method not only allows the message to be transcribed but also captures the emotions expressed at the time of recording by observing variations in the different curves."
    },
    "project2": {
      "title": "New Life Project",
      "description": "The app \"New Life\" is an innovative mobile application designed to support users in their journey to quit smoking. With an intuitive interface and personalized tools, it turns each smoke-free day into a measurable and motivating victory.\n\n<strong>Main Features:</strong>\n• Personalized daily progress tracking\n• Real-time savings calculator\n• Rewards system based on savings achieved\n• Access to tailored advice and craving management strategies\n• Visualization of achievements and statistics\n• Information based on WHO data (2020)\n• Informative section on inequalities and risks related to tobacco\n\n<strong>Technical Requirements:</strong>\n• Android or iOS smartphone\n• Internet connection for data synchronization\n• Local storage for personal data and statistics\n\n<strong>Installation:</strong>\nThe app will be available for free download from the Google Play Store and the App Store. Once installed, creating a personal account allows users to start tracking from their first smoke-free day.\n\n<strong>Configuration:</strong>\nDuring the first launch, users set up their profile (type of tobacco used, frequency, cost, personal motivation). This data is used to personalize advice, savings, and supportive messages displayed in the app.\n\n<strong>Usage:</strong>\nEach day, users can:\n• Track their elapsed smoke-free time\n• View their cumulative financial savings\n• Access personalized advice\n• Log cravings or relapses\n• Plan personal rewards\n\nA \"See More\" section allows users to consult articles, statistics, and inspiring testimonials.\n\n<strong>Security:</strong>\nUser data is stored locally and/or synchronized securely. No sensitive data is shared without explicit consent. The app complies with current GDPR regulations."
    },
    "project3": {
      "title": "Database Project",
      "description": "In our project, the Ministry of Ecology called upon our company, DATA-X, composed of engineers Maxime, Augustin, Evan, and led by project manager Coline, to develop a data management system for air quality around the ten largest French cities. Local meteorological agencies collect this data using sensors, but their storage methods differ. The client therefore wants a reliable relational database to centralize and exploit this information. The project includes managing agencies and their staff, processing air quality data, and generating reports. Examples provided by the client will guide the design of this database. How does it work? We started by developing the data dictionary, the conceptual model (MCD), the logical model, the physical model, as well as the algebraic trees of queries. This allowed us to clearly structure and organize all the necessary elements."
    },
    "project4": {
      "title": "Strongbox 3000 Project",
      "description": "Scenario: Following several incidents of equipment misappropriation, an intelligence agency has requested our services to significantly strengthen its security system. The main objective is to protect sensitive data and prevent any unauthorized access, particularly regarding the creation of a next-generation prototype. The latter is intended to be equipped with more advanced and effective authentication mechanisms. Our mission is therefore to design and implement robust security solutions to ensure the integrity of the prototype and guarantee the confidentiality of the intelligence agency's strategic information. How does it work? The system is an authentication device with five distinct security mechanisms, each corresponding to a specific level of protection.",
      "securityFeatures": {
        "scanDigitalTitle": "Digital Scan",
        "scanDigital": "Advanced digital scanning system enabling secure biometric authentication.",
        "scanRetinalTitle": "Retinal Scan",
        "scanRetinal": "High-precision retinal recognition technology for maximum security.",
        "cardIDTitle": "Card ID",
        "cardID": "The ID card system compares agent numbers with their binary numbers. If the numbers do not match, the system locks.",
        "dynamicCodeTitle": "Dynamic Code",
        "dynamicCode": "Generation of single-use temporary codes for two-factor authentication.",
        "qaAuthTitle": "Q&A Authentication",
        "qaAuth": "System of personalized questions and answers as an additional security layer."
      }
    },
    "project5": {
      "title": "Conway's Game of Life",
      "description": "The Game of Life is a fascinating cellular automaton created by mathematician John Conway in 1970. This project is an interactive implementation that allows exploring emergent patterns and complex behaviors that can arise from very simple rules.<br><br>It was completed in less than a week as part of a two-person group project, using object-oriented programming (OOP) with the C++ language.<br><br>The game's operation is based on a few simple rules:<br>- A dead cell surrounded by exactly three living neighbors becomes alive<br>- A living cell stays alive if it has two or three living neighbors<br>- It dies of loneliness if it has fewer than two living neighbors<br>- It dies of overpopulation if it has more than three<br><br>The game takes place on a two-dimensional grid, with each cell being influenced by its eight adjacent neighbors. Two execution modes are available: a console mode and a graphical mode. The latter offers the possibility to interact directly with the grid, adding or removing cells with a simple click, and adjusting the simulation speed using the '<' and '>' keys.<br><br>An additional feature allows activating the toric mode, in which the edges of the grid are connected to each other, as if the grid were folded onto itself. Finally, obstacle cells can be placed on the grid; these remain fixed and do not undergo any evolution over iterations."
    },
    "project6": {
      "title": "Training Website Project",
      "description": "Online training platform developed with React and Node.js."
    },
    "project7": {
      "title": "Old Portfolio",
      "description": "My previous portfolio was entirely developed using HTML5, CSS3, and JavaScript. It was a front-end project built without any frameworks, in order to strengthen my understanding of core web technologies. The page structure was designed semantically with HTML5, using appropriate tags to improve accessibility and SEO. The visual styling was handled with CSS3, featuring a responsive layout based on Flexbox and CSS Grid, ensuring compatibility across various screen sizes (desktop, tablet, and mobile). Animations and transitions were also implemented to provide a smooth and modern user experience. JavaScript was used to add interactivity: DOM manipulation, interactive effects, smooth scrolling between sections, and conditional logic for certain features. The code is cleanly organized and follows web development best practices, such as separation of concerns, readability, and proper commenting. This portfolio was created to showcase my technical skills, highlight the projects I’ve completed, and serve as a professional online presence for job applications."
    },
    "project8": {
      "title": "Stagelink Project",
      "description": "This project involves the development of a web application designed to centralize internship offers for CESI students. The goal is to simplify the internship search process by gathering all relevant offers and registering partner company data, while providing management tools for different user profiles (students, program coordinators, administrators).\n\n<strong>Main Features:</strong>\n• Role-based authentication (student, coordinator, administrator)\n• Full company management: create, edit, evaluate, delete\n• Internship offer management: search, create, edit, delete, statistics\n• Student and coordinator account management: create, edit, delete\n• Add/remove offers to a wish-list\n• Apply to offers with CV upload and cover letter submission\n• View ongoing applications\n• Dashboard with offer and application statistics for admins\n\n<strong>Technical Requirements:</strong>\n• Apache server with multiple vhost configuration\n• Required languages: HTML5, CSS3, JavaScript, PHP (OOP)\n• Relational database (MySQL, PostgreSQL, etc.)\n• Mandatory MVC architecture\n• Backend template engine usage\n• Use of foreign keys in the database\n• Responsive design for compatibility with all screen sizes\n• Form validation on both client and server sides\n• CMS usage is strictly prohibited\n\n<strong>Installation:</strong>\nThe application will be deployed on an Apache server configured with separate vhosts—one for static content (images, CSS, JS) and another for the dynamic PHP application. The database will be initialized with all necessary tables and relationships.\n\n<strong>Configuration:</strong>\nDuring setup, user roles are defined in a permission matrix. Each user logs in via a secure interface (email/password). Sensitive data is protected following modern security standards (secure cookies, encrypted data, SQL injection protection).\n\n<strong>Usage:</strong>\n• Students can browse and view internship offers, add them to their wish-list, apply, and track their progress.\n• Program coordinators can manage accounts, track student applications, and oversee student activity.\n• Administrators have full access to manage users, offers, and companies.\n\n<strong>Security:</strong>\nThe application complies with GDPR standards. User data is stored securely and only accessible based on assigned permissions. No sensitive information is stored in plain text. Security measures are in place to prevent SQL injection and ensure authentication reliability."
    },
    "project9": {
      "title": "Guest Wifi Plugin",
      "description": "The Guest Wifi plugin is an extension for GLPI 10.x that facilitates the management of temporary Wi-Fi access for visitors within an organization. It offers a clear and intuitive interface for creating, tracking, and managing guest accounts, with automatic validation for long-term access.\n\n<strong>Main features:</strong>\n• Creation and management of guest Wi-Fi accounts\n• Automatic assignment of credentials\n• Ticket validation for long-term access\n• Interface accessible from the Guest Wifi menu\n• Access control through GLPI groups\n• Guest localization based on GLPI sites\n• Usage statistics\n\n<strong>Technical requirements:</strong>\n• GLPI 10.x or higher\n• PHP 7.4 minimum\n• Administration rights on GLPI\n\n<strong>Installation:</strong>\nInstallation is done by downloading the plugin archive, extracting it to the GLPI plugins folder, and then activating it from the Configuration > Plugins menu in the administration interface.\n\n<strong>Configuration:</strong>\nOnce installed, parameters such as the authorized managers group and the threshold of days for access validation need to be configured. General configuration is done via the Guest Wifi > Configuration menu.\n\n<strong>Usage:</strong>\nTo add a guest, simply access the Guest Wifi > Add a guest menu, fill in the necessary information, and validate. Guest management is done from the Guest List, where you can check statuses, filter results, or remove a guest.\n\n<strong>Security:</strong>\nOnly users belonging to the configured managers group have access to the plugin. Wi-Fi credentials are assigned securely, and extended access requires validation through the ticket system."
    },
    "project10": {
      "title": "CET Plugin",
      "description": "p"
    },
    "project11": {
      "title": "Assystem Portal",
      "description": "P"
    }
  },
  "contact": {
    "title": "Contact",
    "name": "Name",
    "email": "Email",
    "company": "Company",
    "message": "Message",
    "send": "Send",
    "next": "Next",
    "back": "Back",
    "success": "Your message has been sent successfully. I will get back to you as soon as possible.",
    "error": "Please fill in all fields.",
    "fillRequired": "Please fill in all required fields.",
    "recaptcha": "Please confirm you are not a robot.",
    "verifyHuman": "Please confirm you are human:",
    "personalInfo": "Personal Information",
    "messageDetails": "Your Message"
  },
  "language": {
    "fr": "FR",
    "en": "GB",
    "switchLanguage": "Switch language"
  },
  "theme": {
    "switchTheme": "Switch theme"
  }
}
