{
  "pageTitle": "Luca's Portfolio",
  "nav": {
    "home": "Home",
    "projects": "Projects",
    "contact": "Contact"
  },
  "home": {
    "title": "Welcome to my Portfolio",
    "subtitle": "Engineering preparatory student, specializing in computer science",
    "presentationText": "Hello, I'm Luca Fourfooz. I love exploring new technologies and creating innovative solutions. When I'm not designing, I enjoy surfing and playing video games!",
    "carouselTitle": "My Skills",
    "projectsCV": {
      "tagline": "Discover my projects and professional journey",
      "viewProjects": "View my projects",
      "downloadCV": "Download my CV"
    },
    "propositions": {
      "title": "My Services",
      "subtitle": "I offer tailored solutions for your digital needs",
      "webDev": {
        "title": "Web Development",
        "description": "Creation of modern, responsive websites optimized for search engines."
      },
      "appDev": {
        "title": "Applications",
        "description": "Development of custom web and mobile applications according to your needs."
      },
      "plugins": {
        "title": "Plugins & Extensions",
        "description": "Creation of plugins and extensions to enhance the functionality of your platforms."
      },
      "contactMe": "Contact Me"
    }
  },
  "projects": {
    "title": "My Projects",
    "viewProject": "View project",
    "details": "Technical details",
    "technologiesUsed": "Technologies used",
    "description": "Description",
    "descriptionComingSoon": "Detailed project description coming soon...",
    "downloadCode": "Download code",
    "viewOnGithub": "View on GitHub",
    "visitSite": "Visit Site",
    "backToProjects": "Back to Projects",
    "projectNotFound": "Project Not Found",
    "projectDoesNotExist": "The project you are looking for does not exist.",
    "inProgress": "In Development",
    "project1": {
      "title": "Escape no Game Project",
      "description": "This project aims to develop a communication solution that works in areas without network coverage, especially where waves are blocked.\n\n<strong>Background:</strong>\nAfter agent K57 was captured in a cyber-pirate base inaccessible through conventional means, it became essential to prevent such situations from happening again. This project focuses on designing a technology adapted to critical and hostile environments.\n\n<strong>How It Works:</strong>\n• The agent speaks into a microphone: the voice is converted into a specific audio signal\n• The signal varies depending on what is said and how it is said (intensity, frequency, amplitude)\n• This audio signal is converted into an electrical signal that mirrors the same variations and timing\n• A transmitter emits the signal on an inaudible frequency, undetectable to enemies\n• A listening agent intercepts, decodes, and transcribes both the original voice and the message\n\n<strong>Technical Aspects:</strong>\n• Real-time conversion of sound into an electrical signal for analysis\n• Transmission via inaudible waves ensures discreet communication\n• Emotional content can be captured by analyzing signal variations (intensity, modulation, frequency)\n\n<strong>Objectives:</strong>\n• Enable secure and undetectable communication in hostile environments\n• Contextualize messages by capturing the speaker’s emotional state\n• Strengthen field technologies for use in extreme or isolated conditions"
    },
    "project2": {
      "title": "New Life Project",
      "description": "The app \"New Life\" is an innovative mobile application designed to support users in their journey to quit smoking. With an intuitive interface and personalized tools, it turns each smoke-free day into a measurable and motivating victory.\n\n<strong>Main Features:</strong>\n• Personalized daily progress tracking\n• Real-time savings calculator\n• Rewards system based on savings achieved\n• Access to tailored advice and craving management strategies\n• Visualization of achievements and statistics\n• Information based on WHO data (2020)\n• Informative section on inequalities and risks related to tobacco\n\n<strong>Technical Requirements:</strong>\n• Android or iOS smartphone\n• Internet connection for data synchronization\n• Local storage for personal data and statistics\n\n<strong>Installation:</strong>\nThe app will be available for free download from the Google Play Store and the App Store. Once installed, creating a personal account allows users to start tracking from their first smoke-free day.\n\n<strong>Configuration:</strong>\nDuring the first launch, users set up their profile (type of tobacco used, frequency, cost, personal motivation). This data is used to personalize advice, savings, and supportive messages displayed in the app.\n\n<strong>Usage:</strong>\nEach day, users can:\n• Track their elapsed smoke-free time\n• View their cumulative financial savings\n• Access personalized advice\n• Log cravings or relapses\n• Plan personal rewards\n\nA \"See More\" section allows users to consult articles, statistics, and inspiring testimonials.\n\n<strong>Security:</strong>\nUser data is stored locally and/or synchronized securely. No sensitive data is shared without explicit consent. The app complies with current GDPR regulations."
    },
    "project3": {
      "title": "Database Project",
      "description": "As part of this project, the Ministry of Ecology commissioned our company, DATA-X—composed of engineers Maxime, Augustin, Evan, and led by project manager Coline—to design a data management system for air quality monitoring around France’s ten largest cities.\n\n<strong>Project Objective:</strong>\n• Centralize air quality data from various local meteorological agencies\n• Provide a reliable, consistent, and queryable relational database\n• Manage agencies, personnel, and environmental data effectively\n\n<strong>Background:</strong>\nLocal meteorological agencies collect data using sensors but store them in heterogeneous formats. The client requires a unified, structured database to facilitate analysis and reporting.\n\n<strong>How It Works:</strong>\n• Development of a data dictionary to list all relevant attributes\n• Creation of a Conceptual Data Model (CDM) to define entities and relationships\n• Design of logical and physical models for database implementation\n• Use of algebraic query trees to optimize data processing\n• Generation of reports based on collected data and client specifications\n\n<strong>Expected Outcome:</strong>\n• A robust, interoperable, and well-documented relational database\n• A platform enabling national-scale environmental monitoring\n• A scalable architecture guided by real-world examples provided by the client"
    },
    "project4": {
      "title": "Strongbox 3000 Project",
      "description": "Scenario: Following multiple incidents involving equipment misappropriation, an intelligence agency has requested our services to significantly reinforce its security system.\n\n<strong>Main Objective:</strong>\n• Protect sensitive data related to a next-generation prototype\n• Prevent unauthorized access to strategic information\n• Ensure the integrity of the device and confidentiality of critical intelligence\n\n<strong>Background:</strong>\nThe prototype is part of a classified project and must integrate advanced authentication mechanisms to mitigate security risks.\n\n<strong>How It Works:</strong>\n• Design of an authentication system based on five distinct security mechanisms\n• Each mechanism corresponds to a specific protection level, combining hardware, software, and biometric approaches\n• Access to the prototype is granted through a step-by-step validation process according to data sensitivity\n\n<strong>Expected Outcome:</strong>\n• A robust and reliable multi-layered security system\n• Complete traceability of all access events\n• An architecture aligned with cybersecurity standards for high-sensitivity systems",
      "securityFeatures": {
        "scanDigitalTitle": "Digital Scan",
        "scanDigital": "Advanced digital scanning system enabling secure biometric authentication.",
        "scanRetinalTitle": "Retinal Scan",
        "scanRetinal": "High-precision retinal recognition technology for maximum security.",
        "cardIDTitle": "Card ID",
        "cardID": "The ID card system compares agent numbers with their binary numbers. If the numbers do not match, the system locks.",
        "dynamicCodeTitle": "Dynamic Code",
        "dynamicCode": "Generation of single-use temporary codes for two-factor authentication.",
        "qaAuthTitle": "Q&A Authentication",
        "qaAuth": "System of personalized questions and answers as an additional security layer."
      }
    },
    "project5": {
      "title": "Conway's Game of Life",
      "description": "The Game of Life is a fascinating cellular automaton created by mathematician John Conway in 1970. This project is an interactive implementation that allows exploring emergent patterns and complex behaviors that can arise from very simple rules.<br><br>It was completed in less than a week as part of a two-person group project, using object-oriented programming (OOP) with the C++ language.<br><br>The game's operation is based on a few simple rules:<br>- A dead cell surrounded by exactly three living neighbors becomes alive<br>- A living cell stays alive if it has two or three living neighbors<br>- It dies of loneliness if it has fewer than two living neighbors<br>- It dies of overpopulation if it has more than three<br><br>The game takes place on a two-dimensional grid, with each cell being influenced by its eight adjacent neighbors. Two execution modes are available: a console mode and a graphical mode. The latter offers the possibility to interact directly with the grid, adding or removing cells with a simple click, and adjusting the simulation speed using the '<' and '>' keys.<br><br>An additional feature allows activating the toric mode, in which the edges of the grid are connected to each other, as if the grid were folded onto itself. Finally, obstacle cells can be placed on the grid; these remain fixed and do not undergo any evolution over iterations."
    },
    "project6": {
      "title": "Training Website Project",
      "description": "The Next.js application is a modern web platform designed for teachers and trainers who want to organize, manage, and share their educational resources with students in a structured, intuitive, and secure way.\n\n<strong>Main Features:</strong>\n• Hierarchical organization of courses grouped into thematic containers for easy navigation\n• Granular access control with the ability to protect specific content with passwords\n• Full administration interface for managing users, containers, and courses\n• Image upload system to visually identify containers quickly\n• Student account creation with customizable access levels\n\n<strong>Typical Use Cases:</strong>\n• A teacher sharing different course materials depending on class level\n• A trainer providing access to certain content only after in-person sessions\n• A school centralizing its educational resources while controlling distribution\n\n<strong>Technical Requirements:</strong>\n• Modern web browser (Chrome, Firefox, Edge...)\n• Internet connection to access secured content\n• Administrator account to configure the teaching environment\n\n<strong>Installation:</strong>\nThe application can be deployed on any server compatible with Next.js. A database (e.g., PostgreSQL or MongoDB) is required to store users and course data. Admin panel access is restricted to authorized users only.\n\n<strong>Configuration:</strong>\nDuring the initial setup, the administrator configures thematic containers, creates user accounts, and sets access levels for different student groups or classes. Images can be uploaded via the user interface to illustrate each container.\n\n<strong>Usage:</strong>\nEach teacher or trainer can:\n• Create courses and organize them into containers\n• Protect specific content with a password\n• Manage student access rights\n• View the course tree structure for clearer navigation\n\nStudents can access the content they are authorized to view in a clean, secure, and structured learning space.\n\n<strong>Security:</strong>\nAccess is managed through a system of roles and permissions. Data is stored securely, and the application complies with GDPR regulations to ensure user privacy."
    },
    "project7": {
      "title": "Old Portfolio",
      "description": "This portfolio was fully developed using HTML5, CSS3, and JavaScript, without any frameworks, to strengthen my mastery of core web technologies.\n\n<strong>Main Features:</strong>\n• Semantic HTML5 structure for better accessibility and SEO optimization\n• Responsive layout using Flexbox and CSS Grid for compatibility across all devices\n• Smooth CSS3 animations and transitions for a modern user experience\n• Interactivity through JavaScript: DOM manipulation, smooth navigation between sections, dynamic effects\n• Clean and well-organized code following best practices (separation of concerns, readability, meaningful comments)\n\n<strong>Project Goals:</strong>\n• Showcase my technical skills with a practical example\n• Highlight completed projects\n• Serve as a professional portfolio for job applications\n\n<strong>Technical Requirements:</strong>\n• Modern web browser (Chrome, Firefox, Edge...)\n• No plugins or external dependencies required\n\n<strong>Usage:</strong>\nVisitors can navigate through various sections to explore my projects, skills, and background. The responsive design ensures a smooth experience across desktop, tablet, and mobile devices.\n\n<strong>Security & Performance:</strong>\nThe site is lightweight, with no external libraries, ensuring fast load times and broad cross-browser compatibility."
    },
    "project8": {
      "title": "Stagelink Project",
      "description": "This project involves the development of a web application designed to centralize internship offers for CESI students. The goal is to simplify the internship search process by gathering all relevant offers and registering partner company data, while providing management tools for different user profiles (students, program coordinators, administrators).\n\n<strong>Main Features:</strong>\n• Role-based authentication (student, coordinator, administrator)\n• Full company management: create, edit, evaluate, delete\n• Internship offer management: search, create, edit, delete, statistics\n• Student and coordinator account management: create, edit, delete\n• Add/remove offers to a wish-list\n• Apply to offers with CV upload and cover letter submission\n• View ongoing applications\n• Dashboard with offer and application statistics for admins\n\n<strong>Technical Requirements:</strong>\n• Apache server with multiple vhost configuration\n• Required languages: HTML5, CSS3, JavaScript, PHP (OOP)\n• Relational database (MySQL, PostgreSQL, etc.)\n• Mandatory MVC architecture\n• Backend template engine usage\n• Use of foreign keys in the database\n• Responsive design for compatibility with all screen sizes\n• Form validation on both client and server sides\n• CMS usage is strictly prohibited\n\n<strong>Installation:</strong>\nThe application will be deployed on an Apache server configured with separate vhosts—one for static content (images, CSS, JS) and another for the dynamic PHP application. The database will be initialized with all necessary tables and relationships.\n\n<strong>Configuration:</strong>\nDuring setup, user roles are defined in a permission matrix. Each user logs in via a secure interface (email/password). Sensitive data is protected following modern security standards (secure cookies, encrypted data, SQL injection protection).\n\n<strong>Usage:</strong>\n• Students can browse and view internship offers, add them to their wish-list, apply, and track their progress.\n• Program coordinators can manage accounts, track student applications, and oversee student activity.\n• Administrators have full access to manage users, offers, and companies.\n\n<strong>Security:</strong>\nThe application complies with GDPR standards. User data is stored securely and only accessible based on assigned permissions. No sensitive information is stored in plain text. Security measures are in place to prevent SQL injection and ensure authentication reliability."
    },
    "project9": {
      "title": "Guest Wifi Plugin",
      "description": "The Guest Wifi plugin is an extension for GLPI 10.x that facilitates the management of temporary Wi-Fi access for visitors within an organization. It offers a clear and intuitive interface for creating, tracking, and managing guest accounts, with automatic validation for long-term access.\n\n<strong>Main features:</strong>\n• Creation and management of guest Wi-Fi accounts\n• Automatic assignment of credentials\n• Ticket validation for long-term access\n• Interface accessible from the Guest Wifi menu\n• Access control through GLPI groups\n• Guest localization based on GLPI sites\n• Usage statistics\n\n<strong>Technical requirements:</strong>\n• GLPI 10.x or higher\n• PHP 7.4 minimum\n• Administration rights on GLPI\n\n<strong>Installation:</strong>\nInstallation is done by downloading the plugin archive, extracting it to the GLPI plugins folder, and then activating it from the Configuration > Plugins menu in the administration interface.\n\n<strong>Configuration:</strong>\nOnce installed, parameters such as the authorized managers group and the threshold of days for access validation need to be configured. General configuration is done via the Guest Wifi > Configuration menu.\n\n<strong>Usage:</strong>\nTo add a guest, simply access the Guest Wifi > Add a guest menu, fill in the necessary information, and validate. Guest management is done from the Guest List, where you can check statuses, filter results, or remove a guest.\n\n<strong>Security:</strong>\nOnly users belonging to the configured managers group have access to the plugin. Wi-Fi credentials are assigned securely, and extended access requires validation through the ticket system."
    },
    "project10": {
      "title": "CET Plugin",
      "description": "p"
    },
    "project11": {
      "title": "Assystem Portal",
      "description": "P"
    },
    "project12": {
      "title": "My Clock",
      "description": "This project is a simple website featuring a real-time digital clock.\n\n<strong>Main Features:</strong>\n• Live time display updated automatically every second\n• Responsive design compatible with desktop, tablet, and mobile devices\n\n<strong>Objectives:</strong>\n• Provide a clear and effective example of real-time interface behavior\n\n<strong>Technologies Used:</strong>\n• HTML5 for page structure\n• CSS3 for styling and responsive layout\n\n<strong>Usage:</strong>\nThe user accesses the page and can view the current time in real-time without needing to refresh. The display adapts to all screen sizes."
    },
    "project13": {
      "title": "Weather station",
      "description": "The \"Worldwide Weather Watcher\" project is an initiative led by the International Agency for Meteorological Vigilance (IAMV), aimed at equipping ocean surveillance vessels with embedded weather stations. The main objective is to measure critical environmental parameters contributing to the formation of cyclones or other natural disasters.\n\n<strong>Context:</strong>\nNumerous maritime transport companies have agreed to equip their vessels with these stations, provided they are simple to use, effective, and can be operated by a crew member. Technical documentation will be provided for this purpose.\n\n<strong>Selected Hardware:</strong>\n• Microcontroller: ATmega328 (Arduino)\n• Storage: SD Card Reader (SPI)\n• Real-time: RTC Clock (I2C)\n• Signaling: RGB LED (2 wires)\n• Interaction: 2 push buttons (digital)\n\n<strong>Integrated Sensors:</strong>\n• Atmospheric pressure (I2C or SPI)\n• Air temperature (I2C or SPI)\n• Hygrometry (I2C or SPI)\n• GPS (UART)\n• Brightness (analog)\n\n<strong>Planned Additional Modules:</strong>\n• Water temperature (analog)\n• Ocean current strength (I2C)\n• Wind force (I2C)\n• Fine particle rate (2 wires)\n\n<strong>Educational Objectives:</strong>\n• Analyze, design, and structure an embedded system in a critical environment\n• Implement sensors and hardware components on microcontroller\n• Provide clear documentation for the end user and supervisor",
      "composants": "List of Components",
      "cards": {
        "microcontroller": {
          "title": "1 Arduino UNO board",
          "image": "/img/projet13/arduino.webp",
          "description": "ref: Arduino UNO R3"
        },
        "storage": {
          "title": "1 SD Card Shield for Arduino",
          "image": "/img/projet13/shield.webp",
          "description": "ref: SD Card Shield v4.3 07/23/2014"
        },
        "rtc": {
          "title": "1 Base Shield for Arduino",
          "image": "/img/projet13/base_shield.webp",
          "description": "ref: Base Shield v2.1 08/31/2015"
        },
        "sensors": {
          "title": "1 USB-A to USB-B cable",
          "image": "/img/projet13/usb.webp",
          "description": "ref: USB cable for Arduino Uno USB30CMARD"
        },
        "rgb": {
          "title": "1 RGB LED",
          "image": "/img/projet13/led.webp",
          "description": "ref: Grove Chainable RGB LED v2.0"
        },
        "buttons": {
          "title": "1 sensor with 2 buttons: green and red",
          "image": "/img/projet13/btn.webp",
          "description": "ref: Grove - Dual Button v1.0"
        },
        "gps": {
          "title": "1 connector cable with one end as individual pins",
          "image": "/img/projet13/connectiques.webp",
          "description": "ref: DeLOCK Conversion IOT Grove 4-pin male to 4x female jumper 20 cm (86947)"
        },
        "light": {
          "title": "1 RTC sensor",
          "image": "/img/projet13/capteur.webp",
          "description": "ref: RTC v1.2"
        },
        "temp": {
          "title": "1 temperature, pressure and humidity sensor",
          "image": "/img/projet13/temp.webp",
          "description": "ref: BME280 WPSE335"
        },
        "humidity": {
          "title": "1 light sensor",
          "image": "/img/projet13/lumi.webp",
          "description": "ref: Grove - Light Sensor v1.2 01/20/2016"
        }
      },
      "montage": "Connections:",
      "explication": "Carefully connect the 3 components in this order, making sure the pins align with the ports",
      "modes": "Operating Modes:",
      "mode1": {
        "title": "Mode 1: Standard Mode",
        "objective": "Objective: Regular acquisition of environmental data.",
        "description": "This mode starts automatically without any button being pressed at startup. The system reads sensors at regular intervals (by default, every 10 minutes, configurable via LOG_INTERVAL). Data is saved in files on the SD card. Each file is limited to 2 KB (FILE_MAX_SIZE), after which a new file is created with a revision number. If a sensor does not respond within a timeout (TIMEOUT) of 30 seconds, the value \"NA\" is recorded."
      },
      "mode2": {
        "title": "Mode 2: Configuration Mode",
        "objective": "Objective: Allow configuration of system parameters.",
        "description": "Accessible by holding down the red button during startup. Sensor acquisition is suspended to allow interaction with the serial interface. Commands configurable via the serial interface: LOG_INTERVAL: Define the measurement interval. FILE_MAX_SIZE: Adjust the maximum size of log files. TIMEOUT: Define the sensor response timeout. RESET: Reset parameters to default values. VERSION: Displays the program version and batch number. CLOCK and DATE: Set the time and date via the RTC. After 30 minutes of inactivity, the system automatically returns to standard mode."
      },
      "mode3": {
        "title": "Mode 3: Maintenance Mode",
        "objective": "Objective: Allow access to data via the serial interface and replace the SD card.",
        "description": "Accessible from standard or economy mode by a long press (5 seconds) on the red button. Data acquisition and recording are suspended, but previously stored data remains accessible. The SD card can be safely removed to avoid file corruption. Another long press on the red button switches the system back to the previous mode."
      },
      "mode4": {
        "title": "Mode 4: Economy Mode",
        "objective": "Objective: Optimize energy consumption.",
        "description": "Access from standard mode by a long press of 5 seconds on the green button. This mode reduces system activity by disabling certain sensors and doubling the acquisition interval (LOG_INTERVAL). A long press on the red button allows returning to standard mode."
      },
      "no-code": "Unfortunately, I don't have the code at hand. If I find it, I'll let you know."
    },
    "project14": {
      "title": "FunkyTown city",
      "description": "Description du projet 14"
    }
  },
  "contact": {
    "title": "Contact",
    "name": "Name",
    "email": "Email",
    "company": "Company",
    "message": "Message",
    "send": "Send",
    "next": "Next",
    "back": "Back",
    "success": "Your message has been sent successfully. I will get back to you as soon as possible.",
    "error": "Please fill in all fields.",
    "fillRequired": "Please fill in all required fields.",
    "recaptcha": "Please confirm you are not a robot.",
    "verifyHuman": "Please confirm you are human:",
    "personalInfo": "Personal Information",
    "messageDetails": "Your Message"
  },
  "language": {
    "fr": "FR",
    "en": "GB",
    "switchLanguage": "Switch language"
  },
  "theme": {
    "switchTheme": "Switch theme"
  },
  "footer": {
    "student": "Engineering Student",
    "webDev": "Web Developer",
    "navigation": "Navigation",
    "social": "Social",
    "allRightsReserved": "All rights reserved."
  }
}
