{
  "pageTitle": "Portfolio de Luca",
  "nav": {
    "home": "Accueil",
    "projects": "Projets",
    "contact": "Contact"
  },
  "home": {
    "title": "Bienvenue sur mon Portfolio",
    "subtitle": "Étudiant en prépa ingénieur, spécialité informatique",
    "presentationText": "Bonjour, je m'appelle Luca. J'adore explorer de nouvelles technologies et créer des solutions innovantes. Lorsque je ne suis pas en train de concevoir, j'aime le surf et jouer à des jeux vidéo !",
    "carouselTitle": "Mes Compétences",
    "projectsCV": {
      "tagline": "Découvrez mes projets et mon parcours professionnel",
      "viewProjects": "Voir mes projets",
      "downloadCV": "Télécharger mon CV"
    },
    "propositions": {
      "title": "Mes Services",
      "subtitle": "Je propose des solutions sur mesure pour vos besoins numériques",
      "webDev": {
        "title": "Développement Web",
        "description": "Création de sites web modernes, responsives et optimisés pour le référencement."
      },
      "appDev": {
        "title": "Applications",
        "description": "Développement d'applications web et mobiles personnalisées selon vos besoins."
      },
      "plugins": {
        "title": "Plugins & Extensions",
        "description": "Création de plugins et extensions pour étendre les fonctionnalités de vos plateformes."
      },
      "contactMe": "Me contacter"
    }
  },
  "projects": {
    "title": "Mes Projets",
    "viewProject": "Voir le projet",
    "details": "Détails techniques",
    "technologiesUsed": "Technologies utilisées",
    "description": "Description",
    "descriptionComingSoon": "Description détaillée du projet à venir...",
    "downloadCode": "Télécharger le code",
    "viewOnGithub": "Voir sur GitHub",
    "visitSite": "Visiter le site",
    "backToProjects": "Retour aux projets",
    "projectNotFound": "Projet non trouvé",
    "projectDoesNotExist": "Le projet que vous recherchez n'existe pas.",
    "project1": {
      "title": "Projet Escape no Game",
      "description": "Ce projet vise à développer une solution garantissant la communication en zones sans réseau, comme celles où les ondes sont bloquées. Suite à l'infiltration de l'agent K57, capturé dans une base de cyberpirates inaccessible aux méthodes classiques, l'objectif est d'éviter que de telles situations se reproduisent en concevant une technologie adaptée à ces environnements critiques. Comment ça fonctionne ? L'agent parle dans un micro, où le son est converti en un signal qui varie selon ce qu'il dit et la manière dont il le dit. Ce signal est caractérisé par son intensité, sa fréquence et son amplitude. Ce signal est ensuite transmis par un émetteur sur une fréquence inaudible, ce qui permet d'envoyer des messages sans risque d'être détecté. L'agent chargé de l'écoute intercepte ce signal, le décode, et retranscrit la voix et le message de l'émetteur. Pour analyser le signal sonore, il est d'abord converti en signal électrique, dont la tension évolue en synchronisation avec le signal sonore et partage la même période Cette méthode permet non seulement de retranscrire le message, mais aussi de capter les émotions exprimées au moment de l'enregistrement, en observant les variations des différentes courbes."
    },
    "project2": {
      "title": "Projet New Life",
      "description": "Application web moderne développée avec Next.js et CSS avancé."
    },
    "project3": {
      "title": "Projet Base de Données",
      "description": "Dans notre projet le ministère de l'Écologie a fait appel à notre entreprise, DATA-X, composée des ingénieurs Maxime, Augustin, Evan et dirigée par la cheffe de projet Coline, pour développer un système de gestion des données sur la qualité de l'air autour des dix plus grandes villes françaises. Les agences météorologiques locales collectent ces données à l'aide de capteurs, mais leurs méthodes de stockage diffèrent. Le client souhaite donc une base de données relationnelle fiable pour centraliser et exploiter ces informations. Le projet inclut la gestion des agences et de leur personnel, le traitement des données sur la qualité de l'air, ainsi que la génération de rapports. Des exemples fournis par le client guideront la conception de cette base de données. Comment ça fonctionne ?Nous avons commencé par élaborer le dictionnaire de données, le modèle conceptuel (MCD), le modèle logique, le modèle physique, ainsi que les arbres algébriques des requêtes. Cela nous a permis de structurer et d'organiser clairement tous les éléments nécessaires."
    },
    "project4": {
      "title": "Projet Strongbox 3000",
      "description": "Mise en situation: Suite à plusieurs incidents de détournements de matériel, une agence d'espionnage a sollicité nos services pour renforcer de manière significative son système de sécurité. L'objectif principal est de protéger les données sensibles et de prévenir tout accès non autorisé, en particulier en ce qui concerne la création d'un prototype de nouvelle génération. Ce dernier est destiné à être équipé de mécanismes d'authentification plus avancés et efficaces. Notre mission consiste donc à concevoir et mettre en place des solutions de sécurité robustes afin d'assurer l'intégrité du prototype et de garantir la confidentialité des informations stratégiques de l'agence d'espionnage. Comment ça fonctionne ? Le système est un dispositif d'authentification doté de cinq mécanismes de sécurité distincts, chacun correspondant à un niveau de protection spécifique.",
      "securityFeatures": {
        "scanDigitalTitle": "Scan Digitale",
        "scanDigital": "Système de scan digital avancé permettant une authentification biométrique sécurisée.",
        "scanRetinalTitle": "Scan Rétinien",
        "scanRetinal": "Technologie de reconnaissance rétinienne de haute précision pour une sécurité maximale.",
        "cardIDTitle": "Carte ID",
        "cardID": "Le système de carte d'identité compare les numéros d'agent avec leurs numéros binaires. Si les numéros ne correspondent pas, le système se verrouille.",
        "dynamicCodeTitle": "Code Dynamique",
        "dynamicCode": "Génération de codes temporaires à usage unique pour l'authentification à deux facteurs.",
        "qaAuthTitle": "Authentification Q&R",
        "qaAuth": "Système de questions et réponses personnalisées comme couche de sécurité supplémentaire."
      }
    },
    "project5": {
      "title": "Jeu de la Vie de Conway",
      "description": "Le Jeu de la Vie est un automate cellulaire fascinant créé par le mathématicien John Conway en 1970. Ce projet est une implémentation interactive qui permet d'explorer les motifs émergents et les comportements complexes qui peuvent naître de règles très simples.<br><br>Il a été réalisé en moins d'une semaine dans le cadre d'un travail en groupe de deux personnes, en utilisant la programmation orientée objet (POO) avec le langage C++.<br><br>Le fonctionnement du jeu repose sur quelques règles simples :<br>- Une cellule morte entourée exactement de trois voisines vivantes devient vivante<br>- Une cellule vivante reste en vie si elle a deux ou trois voisines vivantes<br>- Elle meurt de solitude si elle a moins de deux voisines vivantes<br>- Elle meurt de surpopulation si elle en a plus de trois<br><br>Le jeu s'effectue sur une grille bidimensionnelle, chaque cellule étant influencée par ses huit voisines adjacentes. Deux modes d'exécution sont disponibles : un mode console et un mode graphique. Ce dernier offre la possibilité d'interagir directement avec la grille, en ajoutant ou supprimant des cellules par simple clic, et de régler la vitesse de simulation à l'aide des touches '&lt;' et '&gt;'.<br><br>Une fonctionnalité supplémentaire permet d'activer le mode torique, dans lequel les bords de la grille sont connectés entre eux, comme si la grille était repliée sur elle-même. Enfin, des cellules obstacles peuvent être placées sur la grille ; celles-ci restent figées et ne subissent aucune évolution au fil des itérations."
    },
    "project6": {
      "title": "Projet site de Formation",
      "description": "Plateforme de formation en ligne développée avec React et Node.js."
    },
    "project7": {
      "title": "Ancien Portfolio",
      "description": "Mon précédent portfolio a été entièrement développé en HTML5, CSS3 et JavaScript. Il s'agit d'un projet front-end réalisé sans framework, afin de renforcer ma maîtrise des technologies web fondamentales. La structure de la page a été conçue de manière sémantique avec HTML5, en utilisant des balises adaptées pour améliorer l’accessibilité et le référencement (SEO). Le style visuel a été défini à l’aide de CSS3, avec une mise en page responsive utilisant Flexbox et CSS Grid, ce qui permet une compatibilité sur différents types d’écrans (ordinateurs, tablettes, smartphones). Des animations et des transitions ont été intégrées pour offrir une expérience utilisateur fluide et moderne. Enfin, JavaScript a été utilisé pour dynamiser le site : gestion du DOM, effets interactifs, navigation fluide entre les sections et logique conditionnelle pour certaines fonctionnalités. Le code est organisé de manière claire, en respectant les bonnes pratiques de développement web (séparation des responsabilités, lisibilité, commentaires pertinents). Ce portfolio avait pour objectif de présenter mes compétences techniques, mes projets réalisés, ainsi que de servir de vitrine professionnelle pour mes candidatures."
    },
    "project8": {
      "title": "Projet Stagelink",
      "description": "P"
    },
    "project9": {
      "title": "Plugin Guest Wifi",
      "description": "Le plugin Guest Wifi est une extension destinée à GLPI 10.x qui facilite la gestion des accès Wi-Fi temporaires pour les visiteurs au sein d'une organisation. Il propose une interface claire et intuitive permettant de créer, suivre et gérer les comptes invités, avec une validation automatique prévue pour les accès de longue durée.\n\n<strong>Fonctionnalités principales :</strong>\n• Création et gestion de comptes Wi-Fi invités\n• Attribution automatique d'identifiants\n• Validation par ticket pour les accès de longue durée\n• Interface accessible depuis le menu Guest Wifi\n• Contrôle d'accès par groupes GLPI\n• Localisation des invités basée sur les sites GLPI\n• Statistiques d'usage\n\n<strong>Prérequis techniques :</strong>\n• GLPI 10.x ou supérieur\n• PHP 7.4 minimum\n• Droits d'administration sur GLPI\n\n<strong>Installation :</strong>\nL'installation se fait en téléchargeant l'archive du plugin, en la décompressant dans le dossier plugins de GLPI, puis en l'activant depuis le menu Configuration > Plugins dans l'interface d'administration.\n\n<strong>Configuration :</strong>\nUne fois installé, il faut configurer les paramètres comme le groupe de gestionnaires autorisés et le seuil de jours pour la validation d'accès. La configuration s'effectue via le menu Guest Wifi > Configuration.\n\n<strong>Utilisation :</strong>\nPour ajouter un invité, il suffit d'accéder au menu Guest Wifi > Ajouter un invité, de remplir les informations nécessaires et de valider. La gestion des invités s'effectue depuis la Liste des invités, où l'on peut consulter les statuts, filtrer les résultats ou supprimer un invité.\n\n<strong>Sécurité :</strong>\nSeuls les utilisateurs du groupe de gestionnaires configuré ont accès au plugin. Les identifiants Wi-Fi sont attribués de manière sécurisée, et les accès prolongés nécessitent une validation via le système de tickets."
    },
    "project10": {
      "title": "Plugin CET",
      "description": "P"
    },
    "project11": {
      "title": "Portail Assystem",
      "description": "P"
    }
  },
  "contact": {
    "title": "Contact",
    "name": "Nom",
    "email": "Email",
    "company": "Entreprise",
    "message": "Message",
    "send": "Envoyer",
    "next": "Suivant",
    "back": "Retour",
    "success": "Votre message a été envoyé avec succès. Je vous répondrai dès que possible.",
    "error": "Veuillez remplir tous les champs.",
    "fillRequired": "Veuillez remplir tous les champs obligatoires.",
    "recaptcha": "Veuillez confirmer que vous n'êtes pas un robot.",
    "verifyHuman": "Merci de confirmer que vous êtes humain :",
    "personalInfo": "Informations personnelles",
    "messageDetails": "Votre message"
  },
  "language": {
    "fr": "FR",
    "en": "GB",
    "switchLanguage": "Changer de langue"
  },
  "theme": {
    "switchTheme": "Changer de thème"
  }
}
