{
  "pageTitle": "Portfolio de Luca",
  "nav": {
    "home": "Accueil",
    "projects": "Projets",
    "contact": "Contact"
  },
  "home": {
    "title": "Bienvenue sur mon Portfolio",
    "subtitle": "Étudiant en prépa ingénieur, spécialité informatique",
    "presentationText": "Bonjour, je m'appelle Luca Fourfooz. J'adore explorer de nouvelles technologies et créer des solutions innovantes. Lorsque je ne suis pas en train de concevoir, j'aime le surf et jouer à des jeux vidéo !",
    "ville1": "Rouen",
    "ville2": "Cherbourg",
    "carouselTitle": "Mes Compétences",
    "projectsCV": {
      "tagline": "Découvrez mes projets et mon parcours professionnel",
      "viewProjects": "Voir mes projets",
      "downloadCV": "Télécharger mon CV"
    },
    "propositions": {
      "title": "Mes Services",
      "subtitle": "Je propose des solutions sur mesure pour vos besoins numériques",
      "webDev": {
        "title": "Développement Web",
        "description": "Création de sites web modernes, responsives et optimisés pour le référencement."
      },
      "appDev": {
        "title": "Applications",
        "description": "Développement d'applications web et mobiles personnalisées selon vos besoins."
      },
      "plugins": {
        "title": "Plugins & Extensions",
        "description": "Création de plugins et extensions pour étendre les fonctionnalités de vos plateformes."
      },
      "contactMe": "Me contacter"
    }
  },
  "projects": {
    "title": "Mes Projets",
    "viewProject": "Voir le projet",
    "details": "Détails techniques",
    "technologiesUsed": "Technologies utilisées",
    "description": "Description",
    "descriptionComingSoon": "Description détaillée du projet à venir...",
    "downloadCode": "Télécharger le code",
    "viewOnGithub": "Voir sur GitHub",
    "visitSite": "Visiter le site",
    "backToProjects": "Retour aux projets",
    "projectNotFound": "Projet non trouvé",
    "projectDoesNotExist": "Le projet que vous recherchez n'existe pas.",
    "inProgress": "En cours de développement",
    "project1": {
      "title": "Projet Escape no Game",
      "description": "Ce projet a pour objectif de développer une solution de communication fonctionnelle dans des zones dépourvues de couverture réseau, notamment là où les ondes sont bloquées.\n\n<strong>Contexte :</strong>\nSuite à l'infiltration de l'agent K57, capturé dans une base de cyber-pirates inaccessible par les moyens traditionnels, il devient crucial d'éviter que ce type de situation se reproduise. Ce projet vise donc à concevoir une technologie adaptée aux environnements critiques.\n\n<strong>Fonctionnement :</strong>\n• L’agent parle dans un microphone : la voix est transformée en un signal sonore spécifique\n• Ce signal varie selon ce qui est dit et la manière dont c’est exprimé (intensité, fréquence, amplitude)\n• Le signal est ensuite converti en signal électrique, synchronisé avec la voix et portant les mêmes variations\n• Un transmetteur envoie ce signal sur une fréquence inaudible, indétectable par l’ennemi\n• Un agent récepteur intercepte, décode et retranscrit le message et la voix originale\n\n<strong>Aspects techniques :</strong>\n• Conversion du son en signal électrique pour l’analyse en temps réel\n• Transmission par ondes inaudibles pour une communication discrète\n• Récupération des émotions de l’émetteur via l’étude des variations de courbes (intensité, modulation, fréquence)\n\n<strong>Objectifs :</strong>\n• Assurer des communications sécurisées et discrètes en terrain hostile\n• Permettre la capture d’émotions pour contextualiser les messages\n• Renforcer les technologies de terrain dans des situations extrêmes"
    },
    "project2": {
      "title": "Projet New Life",
      "description": "L'application \"New Life\" est une application mobile innovante conçue pour accompagner les utilisateurs dans leur démarche de sevrage tabagique. Grâce à une interface intuitive et des outils personnalisés, elle transforme chaque jour sans tabac en une victoire mesurable et motivante.\n\n<strong>Fonctionnalités principales :</strong>\n• Suivi personnalisé de la progression quotidienne\n• Calculateur d’économies en temps réel\n• Système de récompenses basé sur les économies réalisées\n• Accès à des conseils adaptés et des stratégies anti-envie\n• Visualisation des accomplissements et des statistiques\n• Informations basées sur les données de l’OMS (2020)\n• Section informative sur les inégalités et les risques liés au tabac\n\n<strong>Prérequis techniques :</strong>\n• Smartphone Android ou iOS\n• Connexion Internet pour la synchronisation des données\n• Stockage local pour les données personnelles et les statistiques\n\n<strong>Installation :</strong>\nL’application sera disponible au téléchargement gratuit depuis le Google Play Store et l’App Store. Une fois installée, la création d’un compte personnel permet de commencer le suivi dès le premier jour sans tabac.\n\n<strong>Configuration :</strong>\nLors du premier lancement, l’utilisateur configure son profil (type de tabac consommé, fréquence, coût, motivation personnelle). Ces données servent à personnaliser les conseils, les économies et les messages de soutien affichés dans l’application.\n\n<strong>Utilisation :</strong>\nChaque jour, l’utilisateur peut :\n• Suivre son temps écoulé sans tabac\n• Visualiser ses économies financières cumulées\n• Accéder à des conseils personnalisés\n• Enregistrer ses envies ou rechutes\n• Planifier des récompenses personnelles\n\nUne section \"Voir plus\" permet de consulter des articles, statistiques et témoignages inspirants.\n\n<strong>Sécurité :</strong>\nLes données de l’utilisateur sont stockées localement et/ou synchronisées de manière sécurisée. Aucune donnée sensible n’est partagée sans consentement explicite. L’application respecte les normes RGPD en vigueur."
    },
    "project3": {
      "title": "Projet Base de Données",
      "description": "Dans le cadre de ce projet, le ministère de l'Écologie a fait appel à notre entreprise, DATA-X, composée des ingénieurs Maxime, Augustin, Evan, sous la direction de la chef de projet Coline, pour concevoir un système de gestion des données sur la qualité de l'air autour des dix plus grandes villes françaises.\n\n<strong>Objectif du projet :</strong>\n• Centraliser les données sur la qualité de l’air provenant de diverses agences locales\n• Fournir une base de données relationnelle fiable, cohérente et exploitable\n• Faciliter la gestion des agences, du personnel, et des données environnementales\n\n<strong>Contexte :</strong>\nLes agences météorologiques locales collectent des données via des capteurs, mais utilisent des systèmes de stockage hétérogènes. Le ministère souhaite harmoniser et structurer ces données pour une meilleure analyse.\n\n<strong>Fonctionnement :</strong>\n• Élaboration d’un dictionnaire de données pour recenser tous les attributs essentiels\n• Création du Modèle Conceptuel de Données (MCD) pour représenter les entités et relations\n• Conception du modèle logique et du modèle physique pour structurer la base dans un SGBD\n• Définition des arbres algébriques des requêtes pour optimiser le traitement des données\n• Génération de rapports basés sur les données collectées, selon les besoins du client\n\n<strong>Résultat attendu :</strong>\n• Une base de données robuste, interopérable, et documentée\n• Une plateforme facilitant la supervision environnementale nationale\n• Une architecture évolutive, guidée par des exemples concrets fournis par le client"
    },
    "project4": {
      "title": "Projet Strongbox 3000",
      "description": "Scénario : À la suite de plusieurs incidents liés au détournement de matériel, une agence de renseignement a sollicité notre expertise pour renforcer considérablement son système de sécurité.\n\n<strong>Objectif principal :</strong>\n• Protéger des données sensibles liées à un prototype de nouvelle génération\n• Empêcher tout accès non autorisé à des informations stratégiques\n• Garantir l'intégrité du dispositif et la confidentialité des données manipulées\n\n<strong>Contexte :</strong>\nLe prototype à sécuriser est au cœur d’un projet confidentiel et devra intégrer des mécanismes d’authentification avancés pour prévenir tout risque de compromission.\n\n<strong>Fonctionnement :</strong>\n• Conception d’un dispositif d’authentification basé sur cinq mécanismes de sécurité distincts\n• Chaque mécanisme correspond à un niveau de protection spécifique, combinant des approches matérielles, logicielles et biométriques\n• L'accès au prototype est soumis à une validation progressive selon le niveau de sensibilité des données\n\n<strong>Résultat attendu :</strong>\n• Un système de sécurité multi-niveaux robuste et fiable\n• Une traçabilité complète des accès\n• Une architecture conforme aux standards de cybersécurité pour les systèmes sensibles",
      "securityFeatures": {
        "scanDigitalTitle": "Scan Digitale",
        "scanDigital": "Système de scan digital avancé permettant une authentification biométrique sécurisée.",
        "scanRetinalTitle": "Scan Rétinien",
        "scanRetinal": "Technologie de reconnaissance rétinienne de haute précision pour une sécurité maximale.",
        "cardIDTitle": "Carte ID",
        "cardID": "Le système de carte d'identité compare les numéros d'agent avec leurs numéros binaires. Si les numéros ne correspondent pas, le système se verrouille.",
        "dynamicCodeTitle": "Code Dynamique",
        "dynamicCode": "Génération de codes temporaires à usage unique pour l'authentification à deux facteurs.",
        "qaAuthTitle": "Authentification Q&R",
        "qaAuth": "Système de questions et réponses personnalisées comme couche de sécurité supplémentaire."
      }
    },
    "project5": {
      "title": "Jeu de la Vie de Conway",
      "description": "Le Jeu de la Vie est un automate cellulaire fascinant créé par le mathématicien John Conway en 1970. Ce projet est une implémentation interactive qui permet d'explorer les motifs émergents et les comportements complexes qui peuvent naître de règles très simples.<br><br>Il a été réalisé en moins d'une semaine dans le cadre d'un travail en groupe de deux personnes, en utilisant la programmation orientée objet (POO) avec le langage C++.<br><br>Le fonctionnement du jeu repose sur quelques règles simples :<br>- Une cellule morte entourée exactement de trois voisines vivantes devient vivante<br>- Une cellule vivante reste en vie si elle a deux ou trois voisines vivantes<br>- Elle meurt de solitude si elle a moins de deux voisines vivantes<br>- Elle meurt de surpopulation si elle en a plus de trois<br><br>Le jeu s'effectue sur une grille bidimensionnelle, chaque cellule étant influencée par ses huit voisines adjacentes. Deux modes d'exécution sont disponibles : un mode console et un mode graphique. Ce dernier offre la possibilité d'interagir directement avec la grille, en ajoutant ou supprimant des cellules par simple clic, et de régler la vitesse de simulation à l'aide des touches '&lt;' et '&gt;'.<br><br>Une fonctionnalité supplémentaire permet d'activer le mode torique, dans lequel les bords de la grille sont connectés entre eux, comme si la grille était repliée sur elle-même. Enfin, des cellules obstacles peuvent être placées sur la grille ; celles-ci restent figées et ne subissent aucune évolution au fil des itérations."
    },
    "project6": {
      "title": "Projet site de Formation",
      "description": "L'application Next.js est une plateforme web moderne conçue pour les enseignants et formateurs souhaitant organiser, gérer et partager leurs ressources pédagogiques avec leurs élèves de manière structurée, intuitive et sécurisée.\n\n<strong>Fonctionnalités principales :</strong>\n• Organisation hiérarchique des cours dans des conteneurs thématiques pour une navigation claire\n• Contrôle d’accès granulaire avec possibilité de protéger certains contenus par mot de passe\n• Interface d’administration complète pour gérer les utilisateurs, les conteneurs et les cours\n• Système d’upload d’images pour une identification visuelle rapide des conteneurs\n• Création de comptes élèves avec gestion des niveaux d’accès personnalisés\n\n<strong>Cas d’utilisation typiques :</strong>\n• Un professeur partageant différents supports selon les classes ou niveaux\n• Un formateur rendant accessibles certains contenus uniquement après une session en présentiel\n• Une école centralisant ses ressources pédagogiques tout en contrôlant leur diffusion\n\n<strong>Prérequis techniques :</strong>\n• Navigateur web moderne (Chrome, Firefox, Edge...)\n• Connexion Internet pour l’accès aux contenus sécurisés\n• Compte administrateur pour configurer l’environnement pédagogique\n\n<strong>Installation :</strong>\nL’application peut être déployée sur n’importe quel serveur compatible avec Next.js. Une base de données (par exemple PostgreSQL ou MongoDB) est nécessaire pour stocker les utilisateurs et les cours. L’accès au panneau d’administration est réservé aux utilisateurs autorisés.\n\n<strong>Configuration :</strong>\nLors du premier déploiement, l’administrateur configure les conteneurs thématiques, crée les comptes utilisateurs, et définit les niveaux d’accès pour chaque groupe d’élèves ou classe. Les images associées aux conteneurs peuvent être ajoutées via l’interface d’upload.\n\n<strong>Utilisation :</strong>\nChaque enseignant ou formateur peut :\n• Créer des cours et les organiser dans des conteneurs\n• Protéger certains contenus par mot de passe\n• Gérer les accès des élèves\n• Visualiser l’arborescence des cours pour une meilleure navigation\n\nLes élèves peuvent quant à eux consulter les cours auxquels ils ont accès, selon les permissions définies, et bénéficier d’un espace organisé et sécurisé pour apprendre.\n\n<strong>Sécurité :</strong>\nLes accès sont contrôlés via un système de rôles et permissions. Les données sont stockées de manière sécurisée et l’application respecte les normes RGPD en vigueur, garantissant la confidentialité des utilisateurs."
    },
    "project7": {
      "title": "Ancien Portfolio",
      "description": "Ce portfolio a été entièrement développé en HTML5, CSS3 et JavaScript, sans l'utilisation de framework, afin de consolider mes compétences en technologies web fondamentales.\n\n<strong>Fonctionnalités principales :</strong>\n• Structure HTML5 sémantique pour une meilleure accessibilité et un bon référencement naturel (SEO)\n• Mise en page responsive avec Flexbox et CSS Grid pour une compatibilité optimale sur tous les écrans\n• Animations CSS3 et transitions pour une expérience utilisateur fluide et moderne\n• Interactivité via JavaScript : manipulation du DOM, navigation fluide entre les sections, effets dynamiques\n• Code clair et bien structuré respectant les bonnes pratiques (séparation des responsabilités, lisibilité, commentaires)\n\n<strong>Objectifs du projet :</strong>\n• Présenter mes compétences techniques de manière concrète\n• Valoriser mes projets réalisés\n• Proposer une vitrine professionnelle lors de mes candidatures\n\n<strong>Prérequis techniques :</strong>\n• Navigateur web moderne (Chrome, Firefox, Edge...)\n• Aucun plugin ou dépendance nécessaire\n\n<strong>Utilisation :</strong>\nL’utilisateur peut naviguer dans les différentes sections pour consulter mes projets, mes compétences et en apprendre plus sur mon parcours. Le design responsive garantit une navigation agréable sur ordinateur, tablette ou mobile.\n\n<strong>Sécurité et performance :</strong>\nLe site est léger, sans dépendances externes, garantissant des temps de chargement rapides et une bonne compatibilité cross-browser."
    },
    "project8": {
      "title": "Projet Stagelink",
      "description": "Ce projet consiste en la création d'une application web permettant de centraliser les offres de stage pour les étudiants du CESI. L’objectif est de faciliter la recherche de stage en regroupant les offres et en enregistrant les données des entreprises partenaires, tout en offrant un espace de gestion aux différents profils d’utilisateurs (étudiants, pilotes de promotion, administrateurs).\n\n<strong>Fonctionnalités principales :</strong>\n• Authentification selon le rôle utilisateur (étudiant, pilote, administrateur)\n• Gestion complète des entreprises : création, modification, évaluation, suppression\n• Gestion des offres de stage : recherche, création, modification, suppression, statistiques\n• Gestion des comptes étudiants et pilotes : création, modification, suppression\n• Ajout et suppression d'offres à la wish-list\n• Postulation à une offre avec envoi de CV et lettre de motivation\n• Affichage des candidatures en cours\n• Tableau de bord statistique pour les administrateurs\n\n<strong>Prérequis techniques :</strong>\n• Serveur Apache avec gestion des vhost\n• Langages requis : HTML5, CSS3, JavaScript, PHP (POO)\n• Base de données relationnelle (MySQL, PostgreSQL, etc.)\n• Architecture MVC obligatoire\n• Moteur de template côté back-end\n• Utilisation de clés étrangères dans la base de données\n• Responsive design pour compatibilité mobile et tablette\n• Vérification des formulaires côté client et serveur\n• Interdiction d’utiliser des CMS\n\n<strong>Installation :</strong>\nLe site sera déployé sur un serveur Apache configuré avec plusieurs vhosts, un pour le contenu statique (images, CSS, JS), un autre pour l'application dynamique PHP. La base de données sera initialisée avec les tables et relations nécessaires au bon fonctionnement du site.\n\n<strong>Configuration :</strong>\nLors de la mise en place du projet, les rôles utilisateurs sont définis dans une matrice de gestion des permissions. Chaque utilisateur se connecte via une interface sécurisée (email/mot de passe). Les données sensibles sont protégées selon les normes de sécurité en vigueur (cookies sécurisés, données chiffrées, protection SQL).\n\n<strong>Utilisation :</strong>\n• Les étudiants peuvent chercher et consulter des offres, les ajouter à leur liste de souhaits, postuler, et suivre leur progression.\n• Les pilotes peuvent gérer les comptes, consulter les statistiques de candidatures et encadrer les étudiants.\n• Les administrateurs disposent de tous les droits, y compris la gestion des utilisateurs, des offres et des entreprises.\n\n<strong>Sécurité :</strong>\nLe projet respecte les normes RGPD. Les données personnelles sont stockées de manière sécurisée et ne sont accessibles que selon les droits de chaque utilisateur. Aucune information sensible n’est conservée en clair. Des mécanismes sont mis en place pour prévenir les attaques type injection SQL et assurer la fiabilité de l’authentification."
    },
    "project9": {
      "title": "Plugin Guest Wifi",
      "description": "Le plugin Guest Wifi est une extension destinée à GLPI 10.x qui facilite la gestion des accès Wi-Fi temporaires pour les visiteurs au sein d'une organisation. Il propose une interface claire et intuitive permettant de créer, suivre et gérer les comptes invités, avec une validation automatique prévue pour les accès de longue durée.\n\n<strong>Fonctionnalités principales :</strong>\n• Création et gestion de comptes Wi-Fi invités\n• Attribution automatique d'identifiants\n• Validation par ticket pour les accès de longue durée\n• Interface accessible depuis le menu Guest Wifi\n• Contrôle d'accès par groupes GLPI\n• Localisation des invités basée sur les sites GLPI\n• Statistiques d'usage\n\n<strong>Prérequis techniques :</strong>\n• GLPI 10.x ou supérieur\n• PHP 7.4 minimum\n• Droits d'administration sur GLPI\n\n<strong>Installation :</strong>\nL'installation se fait en téléchargeant l'archive du plugin, en la décompressant dans le dossier plugins de GLPI, puis en l'activant depuis le menu Configuration > Plugins dans l'interface d'administration.\n\n<strong>Configuration :</strong>\nUne fois installé, il faut configurer les paramètres comme le groupe de gestionnaires autorisés et le seuil de jours pour la validation d'accès. La configuration s'effectue via le menu Guest Wifi > Configuration.\n\n<strong>Utilisation :</strong>\nPour ajouter un invité, il suffit d'accéder au menu Guest Wifi > Ajouter un invité, de remplir les informations nécessaires et de valider. La gestion des invités s'effectue depuis la Liste des invités, où l'on peut consulter les statuts, filtrer les résultats ou supprimer un invité.\n\n<strong>Sécurité :</strong>\nSeuls les utilisateurs du groupe de gestionnaires configuré ont accès au plugin. Les identifiants Wi-Fi sont attribués de manière sécurisée, et les accès prolongés nécessitent une validation via le système de tickets."
    },
    "project10": {
      "title": "Plugin CET",
      "description": "p"
    },
    "project11": {
      "title": "Portail Assystem",
      "description": "P"
    },
    "project12": {
      "title": "Mon horloge",
      "description": "Ce projet est un site web simple intégrant une horloge numérique en temps réel.\n\n<strong>Fonctionnalités principales :</strong>\n• Affichage de l’heure en direct, mise à jour automatiquement chaque seconde\n• Affichage responsive, compatible avec ordinateurs, tablettes et smartphones\n\n<strong>Objectifs :</strong>\n• Offrir un exemple simple et efficace d’interface en temps réel\n\n<strong>Technologies utilisées :</strong>\n• HTML5 pour la structure de la page\n• CSS3 pour le style et la mise en page responsive\n\n<strong>Utilisation :</strong>\nL’utilisateur accède à la page et peut consulter l’heure en temps réel, sans avoir besoin de recharger le site. L’affichage s’adapte à tous les types d’écrans."
    },
    "project13": {
      "title": "Station météo",
      "description": "Le projet \"Worldwide Weather Watcher\" est une initiative portée par l'Agence Internationale pour la Vigilance Météorologique (AIVM), visant à équiper les navires de surveillance océanique avec des stations météo embarquées. L’objectif principal est de mesurer des paramètres environnementaux critiques contribuant à la formation de cyclones ou d’autres catastrophes naturelles.\n\n<strong>Contexte :</strong>\nDe nombreuses sociétés de transport maritime ont accepté d’équiper leurs navires avec ces stations, à condition qu’elles soient simples d’utilisation, efficaces et pilotables par un membre de l’équipage. Une documentation technique sera fournie à cet effet.\n\n<strong>Matériel sélectionné :</strong>\n• Microcontrôleur : ATmega328 (Arduino)\n• Stockage : Lecteur de carte SD (SPI)\n• Temps réel : Horloge RTC (I2C)\n• Signalisation : LED RGB (2 fils)\n• Interaction : 2 boutons poussoirs (numériques)\n\n<strong>Capteurs intégrés :</strong>\n• Pression atmosphérique (I2C ou SPI)\n• Température de l’air (I2C ou SPI)\n• Hygrométrie (I2C ou SPI)\n• GPS (UART)\n• Luminosité (analogique)\n\n<strong>Modules complémentaires prévus :</strong>\n• Température de l’eau (analogique)\n• Force du courant marin (I2C)\n• Force du vent (I2C)\n• Taux de particules fines (2 fils)\n\n<strong>Objectifs pédagogiques :</strong>\n• Analyser, concevoir et structurer un système embarqué en environnement critique\n• Mettre en œuvre des capteurs et composants matériels sur microcontrôleur\n• Fournir une documentation claire pour l’utilisateur et le superviseur final",
      "composants": "liste des Composants :",
      "cards": {
        "microcontroller": {
          "title": "1 Carte Arduino UNO",
          "image": "/img/projet13/arduino.webp",
          "description": "ref : Arduino UNO R3"
        },
        "storage": {
          "title": "1 Shield de carte SD pour Arduino",
          "image": "/img/projet13/shield.webp",
          "description": "ref : SD Card shield v4.3 07/23/2014"
        },
        "rtc": {
          "title": "1 Base Shield pour Arduino",
          "image": "/img/projet13/base_shield.webp",
          "description": "ref : Base Shield v2.1 08/31/2015"
        },
        "sensors": {
          "title": "1 câble USB-A vers USB-B",
          "image": "/img/projet13/usb.webp",
          "description": "ref : Cable pour carte Arduino Uno USB30CMARD"
        },
        "rgb": {
          "title": "1 LED RGB",
          "image": "/img/projet13/led.webp",
          "description": "ref : Grove Chainable RGB LED v2.0"
        },
        "buttons": {
          "title": "1 capteur regroupant 2 boutons , un vert et un rouge",
          "image": "/img/projet13/btn.webp",
          "description": "ref : Grove - Dual Button v1.0."
        },
        "gps": {
          "title": "1 câble de connectique avec un côté, des broches séparées",
          "image": "/img/projet13/connectiques.webp",
          "description": "ref :DeLOCK Conversion IOT Grove Câble 4 broches mâle vers 4 x Jumper femelle 20 cm (86947)"
        },
        "light": {
          "title": "1 Capteur RTC ",
          "image": "/img/projet13/capteur.webp",
          "description": "ref : RTC v1.2"
        },
        "temp": {
          "title": "1 Capteur de température, pression, humidité ",
          "image": "/img/projet13/temp.webp",
          "description": "ref : BME280 WPSE335"
        },
        "humidity": {
          "title": "1 Capteur de luminosité  ",
          "image": "/img/projet13/lumi.webp",
          "description": "ref : Grove - Light sensor v1.2 01/20/2016"
        }
      },
      "montage": "Les Branchements :",
      "explication": "Emboiter les 3 composants dans cet ordre  délicatement en faisant correspondre les broches aux ports",
      "modes": "Modes de fonctionnement :",
      "mode1": {
        "title": "Mode 1 : Mode Standard",
        "objective": "Objectif : Acquisition régulière des données environnementales.",
        "description": "Ce mode démarre automatiquement sans qu'aucun bouton ne soit pressé au démarrage. Le système lit les capteurs à intervalles réguliers (par défaut, toutes les 10 minutes, configurables via LOG_INTERVAL). Les données sont sauvegardées dans des fichiers sur la carte SD. Chaque fichier est limité à 2 Ko (FILE_MAX_SIZE), après quoi un nouveau fichier est créé avec un numéro de révision. Si un capteur ne répond pas dans un délai (TIMEOUT) de 30 secondes, la valeur \"NA\" est enregistrée."
      },
      "mode2": {
        "title": "Mode 2 : Mode Configuration",
        "objective": "Objectif : Permettre la configuration des paramètres du système.",
        "description": "Accessible en maintenant le bouton rouge enfoncé lors du démarrage. L'acquisition des capteurs est suspendue pour permettre l'interaction avec l'interface série. Commandes configurables via l'interface série : LOG_INTERVAL : Définir l'intervalle de mesure. FILE_MAX_SIZE : Ajuster la taille maximale des fichiers de log. TIMEOUT : Définir le délai de réponse des capteurs. RESET : Réinitialisation des paramètres aux valeurs par défaut. VERSION : Affiche la version du programme et un numéro de lot. CLOCK et DATE : Définissent l'heure et la date via le RTC. Après 30 minutes d'inactivité, le système retourne automatiquement en mode standard."
      },
      "mode3": {
        "title": "Mode 3 : Mode Maintenance",
        "objective": "Objectif : Permettre l'accès aux données via l'interface série et remplacer la carte SD.",
        "description": "Accessible depuis le mode standard ou économique par un appui prolongé (5 secondes) sur le bouton rouge. L'acquisition et l'enregistrement des données sont suspendus, mais les données déjà stockées restent accessibles. La carte SD peut être retirée en toute sécurité pour éviter la corruption des fichiers. Un nouvel appui prolongé sur le bouton rouge fait basculer le système vers le mode précédent."
      },
      "mode4": {
        "title": "Mode 4 : Mode Économique",
        "objective": "Objectif : Optimiser la consommation d'énergie.",
        "description": "Accès depuis le mode standard par un appui prolongé de 5 secondes sur le bouton vert. Ce mode réduit l'activité du système en désactivant certains capteurs et en doublant l'intervalle d'acquisition (LOG_INTERVAL). Un appui long sur le bouton rouge permet de revenir en mode standard."
      },
      "no-code": "Malheureusement, je n'ai pas le code sous la main. Si je le retrouve, je vous ferai signe."
    },
    "project14": {
      "title": "FunkyTown city",
      "description": "Description du projet 14"
    }
  },
  "contact": {
    "title": "Contact",
    "name": "Nom",
    "email": "Email",
    "company": "Entreprise",
    "message": "Message",
    "send": "Envoyer",
    "next": "Suivant",
    "back": "Retour",
    "success": "Votre message a été envoyé avec succès. Je vous répondrai dès que possible.",
    "error": "Veuillez remplir tous les champs.",
    "fillRequired": "Veuillez remplir tous les champs obligatoires.",
    "recaptcha": "Veuillez confirmer que vous n'êtes pas un robot.",
    "verifyHuman": "Merci de confirmer que vous êtes humain :",
    "personalInfo": "Informations personnelles",
    "messageDetails": "Votre message"
  },
  "language": {
    "fr": "FR",
    "en": "GB",
    "switchLanguage": "Changer de langue"
  },
  "theme": {
    "switchTheme": "Changer de thème"
  },
  "qrcode": {
    "title": "Scannez 🚀",
    "buttonTitle": "Afficher le QR Code"
  },
  "footer": {
    "student": "Etudiant en cycle ingénieur",
    "webDev": "Développeur Web",
    "navigation": "Navigation",
    "social": "Social",
    "allRightsReserved": "Tous droits réservés."
  }
}
